/* State and Keywordgroupnames */
"Variable Definitions" 				= "@Variable: (Definitions)";
"CSS Rules" 						= "@CSS Rules";
"Mixins" 							= ".Mixins();";
"Pseudo Selectors"					= "Pseudo Selectors (:hover, ::before, …)";
"Selectors" 						= "CSS Selectors (#id, .class)";
"Selector Operators"				= "Selector Operators (&, *, >, …)";
"HTML Elements" 					= "HTML Selectors (body, div, …)";
"CSS Keywords" 						= "CSS Keywords";

"AutodocComment" 					= "/*\" Comment \"*/";
"Comment" 							= "/* Comment */";
"SingleComment" 					= "// Comment";

"String" 							= "\"Strings\"";
"SingleString" 						= "'Strings'";
"Interpolated Variables" 			= "@{Variables}";

"Attribute State"					= "Attribute State";
"Operators"							= "Operators (+,-,*,/)";
"!important"						= "!important";
"Attributes" 						= "Attributes";
"Digits" 							= "Digits";
"Colors" 							= "Colors";
"Variables" 						= "@Variables";

"Inside Parens" 					= "(Inside parentheses)";

"Inline Javascript"					= "`Javascript`";
"/Javascript/Keywords"				= "Keywords";
"/Javascript/Numbers"				= "Numbers";
"/Javascript/Characters"			= "Characters";
"/Javascript/FunctionRegex"			= "Function Calls";
"/Javascript/AutodocComment"		= "/*\" Comment \"*/";
"/Javascript/Comment"				= "/* Comment */";
"/Javascript/SingleComment"			= "// Comment";
"/Javascript/String"				= "\"Strings\"";
"/Javascript/SingleString"			= "'Strings'";
"/Javascript/Regular Expressions"	= "Regular Expressions";
"/Javascript/Escaped Characters"	= "Escaped Characters";